#include <stdio.h>
#include <locale.h>
#define C 14;
/*Мальчик может бегать в три раза быстрее, чем ходить. Скорость его ходьбы равна 4
км/час. Он принял участие в марафонском забеге, но сошел с дистанции, пробежав
только х км. Сколько времени он затратил на пре-одоление этого расстояния?
ВАРИАНТ 7*/
main()
{
	setlocale(LC_ALL, "RUS");
	f();
}

f()
{
	puts("Мальчик может бегать в три раза быстрее, чем ходить.\nСкорость его ходьбы равна 4км / час.\nОн принял участие в марафонском забеге, но сошел с дистанции, пробежав только х км.\nСколько времени он затратил на преодоление этого расстояния ? ");
	float l, s, t, sk_h, sk_b;
	sk_h = 4.;
	printf("Скорость ходьбы = %.1f км/ч\n", sk_h);
	sk_b = sk_h * 3;
	printf("Скороть бега = %.1f км/ч\n", sk_b);
	printf("Введите значение s в км:");
	scanf("%f", &s);
	t = s / sk_b;
	printf("Тогда мальчик пробежал %.1f км за %.3f часов(а)", s, t);
	return 1;
}